{
    "Caries": "Caries, commonly known as tooth decay, is caused by bacterial activity on sugar residues in the mouth, leading to enamel erosion. To manage this before visiting the doctor, patients should reduce sugar intake, maintain oral hygiene by brushing twice daily with fluoride toothpaste, and rinse with a saline solution. Dentists typically treat caries by removing the decayed portion and filling it with materials like composite resin or amalgam. In severe cases, root canal treatment may be required.",
    
    "Gingivitis": "Gingivitis, or gum inflammation, is often caused by poor oral hygiene, plaque buildup, or hormonal changes. Patients can manage it by flossing daily, using antiseptic mouthwash, and gently massaging their gums. Warm saltwater rinses may also reduce inflammation. A dentist might perform professional cleaning, scaling, or root planing to remove plaque and tartar, followed by advice on improving oral hygiene practices.",
    
    "Hypodontia": "Hypodontia, the congenital absence of one or more teeth, can be due to genetic factors or developmental anomalies. Before visiting the dentist, patients should maintain a balanced diet and good oral hygiene to protect their remaining teeth. Dentists may recommend prosthetic replacements such as bridges, dentures, or implants. Orthodontic treatments might also be considered to address spacing issues and enhance functionality.",
    
    "Mouth_ulcer": "Mouth ulcers can result from stress, accidental bites, spicy foods, or deficiencies in vitamins like B12. Patients should avoid spicy or acidic foods, keep their mouths clean, and use topical gels or saltwater rinses for relief. Doctors may prescribe medicated mouthwashes, topical ointments, or recommend dietary supplements. If ulcers persist, underlying conditions will be investigated.",
    
    "Tooth_discoloration": "Tooth discoloration may arise from consuming staining substances like coffee, smoking, or enamel erosion. Patients can reduce staining by avoiding these habits, brushing with whitening toothpaste, and using a straw for colored beverages. Dentists might recommend professional cleaning, whitening procedures, or, in severe cases, veneers or crowns to restore natural color and aesthetics."
}
  